# -*- coding: utf8 -*-
"""
=======================
接口中的对象属性定义
=======================

----------------
用户（User）:
----------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
user_id                string     用户唯一标识
name                   string     用户名
nickname               string     用户昵称
signature              string     用户签名
logo                   url        用户小头像
photo                  url        用户大头像
birthday               string     生日
email                  string     邮箱地址
phone                  string     手机号码
binding                dict       平台绑定信息
gender                 int        性别，0未知，1男，2女
favor_count            int        收藏视频数量
subscriptions          int        订阅游戏数量
video_count            int        发布视频数量
follower_count         int        粉丝数
following_count        int        关注数
is_followed            bool       当前用户是否已关注该用户
gem                    int        游票数量(隐私数据, 需登录)
gold                   int        游米数量(隐私数据, 需登录)
gift_num               int        礼物数量(隐私数据, 需登录)
==================     =========  =====================

----------------
游戏（Game）:
----------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
game_id                string     游戏唯一标识
name                   string     游戏名称
icon                   url        游戏图标
big_icon               url        游戏大图标
cover                  url        游戏封面
url                    url        游戏下载链接
contain_sdk            bool       是否包含录制SDK
description            string     游戏描述
developer              string     游戏开发商
subscription_count     int        被订阅次数
video_count            int        视频总数
subscribed             int        当前用户是否已订阅该游戏
create_at              float      创建时间
package_id             string     游戏软件包标识
package_version        string     游戏展示版本号
package_size           float      游戏包大小
popular_count          int        热门视频个数
bid                    string     对应咪咕游戏ID
==================     =========  =====================

----------------
视频（Video）:
----------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
video_id               string     视频唯一标识
title                  string     视频描述
ratio                  string     分辨率，格式:宽x高，如1280x800
url                    url        视频地址
cover                  url        视频封面
author                 User       视频作者
is_liked               bool       当前用户是否已点赞
like_count             bool       被点赞次数
create_at              float      创建时间
is_favored             bool       当前用户是否已经收藏
game                   Game       视频所属游戏信息
comment_count          int        评论数量
gift_count             int        礼物次数
gift_num               int        礼物数量
vv                     int        播放次数
duration               int        时长（秒）
share_url              url        分享链接
gift_count             int        送礼物次数
gift_num               int        送礼物数量
is_online              bool       是否在线
event_id               int        直播间ID
==================     =========  =====================

----------------
评论（Comment）:
----------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
comment_id             string     评论唯一标识
video_id               string     视频ID
author                 User       评论作者
content                string     评论内容
create_at              float      评论时间
reply                  int        被回复次数
like                   int        被点赞次数
liked                  int        当前用户是否已点赞
==================     =========  =====================

--------------------------
点赞&评论消息（Message）:
--------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
msg_id                 string     消息唯一标识
ctype                  string     对象类型(video:视频, comment:评论， reply:评论回复)
obj                    string     对象ID
action                 string     产生消息动作(like:点赞, comment:评论, reply:回复, gift:送礼)
operator               string     操作用户
create_at              timestamp  创建时间
==================     =========  =====================

-----------------------
系统消息（SysMessage）:
-----------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
msg_id                 string     消息唯一标识
title                  string     标题
image                  url        缩略图
content                string     正文
link                   string     跳转链接
create_at              timestamp  创建时间
==================     =========  =====================

----------------
私信（Letter）:
----------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
msg_id                 string     消息唯一标识
sender                 string     发送者
content                string     内容
create_at              timestamp  创建时间
==================     =========  =====================

------------------
评论回复（Reply）:
------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
reply_id               string     回复唯一标识
reply_from             string     回复者
reply_to               string     被回复者
content                string     回复内容
reply_count            int        被回复次数
create_at              timestamp  创建时间
==================     =========  =====================

------------------------
物品（Product）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
product_id             int        物品ID
product_image          url        物品图片
product_name           string     物品名称
product_type           int        物品类型(1-10依次: 游票,游米,礼物,全网流量,移动流量,联通流量,电信流量,实物,礼包,话费)
==================     =========  =====================

------------------------
游米交易记录（GoldLog）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
gold                   int        游米数量
action                 int        交易类型(1:任务奖励, 2:购买礼物, 3:兑换物品, 4:抽奖消费, 5:抽奖)
desc                   string     交易描述
create_at              timestamp  交易时间
==================     =========  =====================

------------------------
游票交易记录（GemLog）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
gem                    int        游票数量
action                 int        交易类型(1:任务奖励, 2:购买礼物, 3:兑换物品, 4:抽奖消费, 5:抽奖)
desc                   string     交易描述
create_at              timestamp  交易时间
==================     =========  =====================

------------------------
用户任务（UserTask）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
user_id                string     用户ID
task_id                int        任务ID
title                  string     任务标题
description            string     任务描述
image                  url        任务图片
task_type              int        任务类型(1:新手, 2:日常, 3:游戏)
action                 int        任务条件
num                    int        条件数值
finish_num             int        已完成数值
game_id                string     游戏ID(游戏任务)
task_status            int        完成状态(1:未完成, 2:已完成, 3:已领取)
btn_desc               string     按钮描述
==================     =========  =====================

------------------------
任务奖励（Reward）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
name                   string     奖励物品名称
num                    int        奖励物品数量
==================     =========  =====================

------------------
礼物（Gift）:
------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
gift_id                int        礼物ID
product_id             int        物品ID
product_name           string     物品名称
product_image          url        物品图片
product_type           int        物品类型(1:游票, 2:游米, 3:礼物)
credit_type            int        价格类型(1:游票价格, 2:游米价格, 3:每日免费次数)
credit_value           int        价格数值
on_sale                bool       是否在售
==================     =========  =====================

------------------------
开屏广告（LaunchAds）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
ad_id                  string     广告ID
image                  url        广告图片
duration               int        显示时间(秒)
action                 string     跳转链接
==================     =========  =====================

------------------------
商店（Store）:
------------------------
==================     =============  =====================
属性名                  类型           说明
==================     =============  =====================
store_id               int            商店ID
title                  string         商店描述
credit_type            int            价格类型(1:游票价格, 2:游米价格)
credit_value           int            价格数值
status                 int            状态(1:进行中, 2:暂停, 3:结束)
action                 string         跳转链接
share_url              url            分享链接
share_image            url            分享图片
share_title            string         分享标题
expire_at              timestamp      结束日期
items                  <Item>list     商品列表
==================     =============  =====================

------------------------
商品（Item）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
item_id                int        商品ID
left_num               int        剩余库存(份)
product                Product    物品
product_num            int        物品数量
title                  string     商品描述
credit_type            int        价格类型(1:游票价格, 2:游米价格)
credit_value           int        价格数值
==================     =========  =====================

------------------------
用户订单（Order）:
------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
order_id               int        订单ID
title                  string     商品描述
product                Product    物品
status                 int        状态(1:未领取, 2:处理中, 3:已完成)
create_at              timestamp  创建时间
result                 dict       营销平台返回结果
==================     =========  =====================

-----------------------------
视频分类（VideoCategory）:
-----------------------------
==================     =========  =====================
属性名                  类型       说明
==================     =========  =====================
category_id            int        分类ID
category_name          string     分类名称
==================     =========  =====================
"""
